[Killed] Regex
main/components/UCSBDates/UCSBDateForm.js:25:5
 
   // Stryker disable next-line Regex
   const isodate_regex =
-    /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
+    /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\DT[0-2]\d:[0-5]\d)/i;
 
   // Stryker disable next-line all
killedBy: UCSBDateForm tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] Regex
main/components/UCSBDates/UCSBDateForm.js:25:5
 
   // Stryker disable next-line Regex
   const isodate_regex =
-    /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
+    /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[^0-3]\dT[0-2]\d:[0-5]\d)/i;
 
   // Stryker disable next-line all
killedBy: UCSBDateForm tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] LogicalOperator
main/components/UCSBDates/UCSBDateForm.js:64:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.quarterYYYYQ && "QuarterYYYYQ is required. "}
-              {errors.quarterYYYYQ?.type === "pattern" &&
-                "QuarterYYYYQ must be in the format YYYYQ, e.g. 20224 for Fall 2022"}
+              {errors.quarterYYYYQ?.type === "pattern" || "QuarterYYYYQ must be in the format YYYYQ, e.g. 20224 for Fall 2022"}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: UCSBDateForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">QuarterYYYYQ must be in the format YYYYQ, e.g. 20224 for Fall 2022</div> instead
