[Survived] StringLiteral
main/components/Nav/AppNavbarLocalhost.js:23:37
                 <p>
                   Running on <code>{url}</code> with no backend.
                   <br />
-                  You probably want{" "}
+                  You probably want{""}
                   <a href="http://localhost:8080">http://localhost:8080</a>{" "}
                   instead.
